[Ability.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寒冰韧性"
mTooltip="在每个战斗回合开始时，所有相邻的友军获得对任何移动力降低效果的免疫力，持续至战斗回合结束。"

[Ability.A_ShieldProtection_Buff H7BaseBuff]
mName="寒冰护盾"
mTooltip="该生物在 %durnow 回合内承受 %res 伤害。"

[Ability2.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寒冰护盾"
mTooltip="治疗所有相邻友军 %d2 %icon_health 点生命值，并为其施加一个护盾，在 %buff.buff.durini 回合内使其所受伤害减少 %buff1.buff.res。\n每场战斗一次。"

[Cretaure_t1.A_Creature_t1_base H7Creature]
mName="雪地战士"
mLore="冰峰联盟成立后，强大的乌库尔军队转变为了城市守卫。他们经验丰富，擅长冬季作战，对霜冻和寒冷具有抗性，是联盟城市抵御不速之客和威胁城邦公民的危险生物的完美防御者。"

[Cretaure_t1.A_Creature_t1_base_base H7Creature]
mName="守护者"
mLore="龙脉隘口的雪山是危险区域。不仅是天气条件可能危及生命，还有各种奇异的魔法和危险生物潜伏在那里，等待粗心的流浪者。来到联盟城市的最优秀的战士们组成了守护者。他们的工作是保卫道路和在联盟各处行走的人们。"

[Ability.A_Incapacitated_Immunity_Buff H7BaseBuff]
mName="寒冰韧性"
mTooltip="该生物在 %durnow 回合内免疫所有移动力降低效果。"